//Напишите программу, которая на вход принимает число и выдаёт его квадрат
//(число умноженное на само себя).

//Например:
//4 -> 16 
//-3 -> 9 
//-7 -> 49

int Prompt(string message)
{    
System.Console.Write("Введите число >");
string inputString = Console.ReadLine();
int value = Convert.ToInt32(inputString);
return value;
}

int value = Prompt("Введите число >");
int square = value * value;
System.Console.WriteLine($"Квадрат числа {value} равен {square}");
